; domain
(define (domain roominhab-domain)
    (:requirements :typing)
    (:types
        time - object
        inhabitant - object
        room - object
    )
    (:predicates
        (timeSlotOccupied ?time - time)
        (roomUnlocked ?room - room)
        (roomOccupied ?room - room)
        (hasRoom ?inhab - inhabitant)
        (canArrive ?time - time ?inhab - inhabitant ?room - room)
        (at ?room - room)
    )
    (:action showRoom
        :parameters (?room - room ?inhab - inhabitant ?time - time)
        :precondition (and
            (canArrive ?time ?inhab ?room)
            (not (timeSlotOccupied ?time))
            (at ?room)
            (roomUnlocked ?room)
            (not (roomOccupied ?room))
            (not (hasRoom ?inhab))
        )
        :effect (and
            (timeSlotOccupied ?time)
            (roomOccupied ?room)
            (hasRoom ?inhab)
        )
    )
    (:action unlockRoom
        :parameters (?room - room)
        :precondition (at ?room)
        :effect (roomUnlocked ?room)
    )
    (:action move
        :parameters(?room1 - room ?room2 - room)
        :precondition(at ?room1)
        :effect (and
            (at ?room2)
            (not (at ?room1))
        )
    )
)

; problem
(define (problem roominhab-problem)
  (:domain roominhab-domain)
  (:objects 
    inhabitant1 - inhabitant
    inhabitant2 - inhabitant
    inhabitant3 - inhabitant
    inhabitant4 - inhabitant
    inhabitant5 - inhabitant
    inhabitant6 - inhabitant
    inhabitant7 - inhabitant
    inhabitant8 - inhabitant
    inhabitant9 - inhabitant
    inhabitant10 - inhabitant
    lobby - room
    room1 - room
    room2 - room
    room3 - room
    room4 - room
    room5 - room
    room6 - room
    room7 - room
    room8 - room
    room9 - room
    room10 - room
    am0900 - time
    am0915 - time
    am0930 - time
    am0945 - time
    am1000 - time
    am1015 - time
    am1030 - time
    am1045 - time
    am1100 - time
    am1115 - time
  )
  (:init 
    (at lobby)
    (canArrive am0900 inhabitant1 room1)
    (canArrive am0915 inhabitant1 room1)
    (canArrive am0945 inhabitant2 room2)
    (canArrive am1115 inhabitant2 room2)
    (canArrive am0930 inhabitant3 room3)
    (canArrive am0945 inhabitant3 room3)
    (canArrive am1000 inhabitant4 room4)
    (canArrive am0915 inhabitant4 room4)
    (canArrive am1015 inhabitant5 room5)
    (canArrive am0945 inhabitant6 room6)
    (canArrive am1045 inhabitant6 room6)
    (canArrive am1100 inhabitant7 room7)
    (canArrive am1115 inhabitant8 room8)
    (canArrive am1045 inhabitant8 room8)
    (canArrive am1030 inhabitant9 room9)
    ;(canArrive am1115 inhabitant10 room10)
    ;(canArrive am0930 inhabitant10 room10)
  )
  (:goal (and
        (hasRoom inhabitant1)
        (hasRoom inhabitant2)
        (hasRoom inhabitant3)
        (hasRoom inhabitant4)
        (hasRoom inhabitant5)
        (hasRoom inhabitant6)
        (hasRoom inhabitant7)
        (hasRoom inhabitant8)
        (hasRoom inhabitant9)
        ;(hasRoom inhabitant10)
    )
   )
)

; plan
1. (move lobby room9)
   deleted: (at lobby)
   added: (at room9)
   goals met: 0 of 9
2. (unlockroom room9)
   added: (roomunlocked room9)
   goals met: 0 of 9
3. (showroom room9 inhabitant9 am1030)
   added: (timeslotoccupied am1030) (roomoccupied room9) (hasroom inhabitant9)
   goals met: 1 of 9
4. (move room9 room8)
   deleted: (at room9)
   added: (at room8)
   goals met: 1 of 9
5. (unlockroom room8)
   added: (roomunlocked room8)
   goals met: 1 of 9
6. (showroom room8 inhabitant8 am1045)
   added: (timeslotoccupied am1045) (roomoccupied room8) (hasroom inhabitant8)
   goals met: 2 of 9
7. (move room8 room7)
   deleted: (at room8)
   added: (at room7)
   goals met: 2 of 9
8. (unlockroom room7)
   added: (roomunlocked room7)
   goals met: 2 of 9
9. (showroom room7 inhabitant7 am1100)
   added: (timeslotoccupied am1100) (roomoccupied room7) (hasroom inhabitant7)
   goals met: 3 of 9
10. (move room7 room6)
   deleted: (at room7)
   added: (at room6)
   goals met: 3 of 9
11. (unlockroom room6)
   added: (roomunlocked room6)
   goals met: 3 of 9
12. (showroom room6 inhabitant6 am0945)
   added: (timeslotoccupied am0945) (roomoccupied room6) (hasroom inhabitant6)
   goals met: 4 of 9
13. (move room6 room5)
   deleted: (at room6)
   added: (at room5)
   goals met: 4 of 9
14. (unlockroom room5)
   added: (roomunlocked room5)
   goals met: 4 of 9
15. (showroom room5 inhabitant5 am1015)
   added: (timeslotoccupied am1015) (roomoccupied room5) (hasroom inhabitant5)
   goals met: 5 of 9
16. (move room5 room4)
   deleted: (at room5)
   added: (at room4)
   goals met: 5 of 9
17. (unlockroom room4)
   added: (roomunlocked room4)
   goals met: 5 of 9
18. (showroom room4 inhabitant4 am1000)
   added: (timeslotoccupied am1000) (roomoccupied room4) (hasroom inhabitant4)
   goals met: 6 of 9
19. (move room4 room3)
   deleted: (at room4)
   added: (at room3)
   goals met: 6 of 9
20. (unlockroom room3)
   added: (roomunlocked room3)
   goals met: 6 of 9
21. (showroom room3 inhabitant3 am0930)
   added: (timeslotoccupied am0930) (roomoccupied room3) (hasroom inhabitant3)
   goals met: 7 of 9
22. (move room3 room2)
   deleted: (at room3)
   added: (at room2)
   goals met: 7 of 9
23. (unlockroom room2)
   added: (roomunlocked room2)
   goals met: 7 of 9
24. (showroom room2 inhabitant2 am1115)
   added: (timeslotoccupied am1115) (roomoccupied room2) (hasroom inhabitant2)
   goals met: 8 of 9
25. (move room2 room1)
   deleted: (at room2)
   added: (at room1)
   goals met: 8 of 9
26. (unlockroom room1)
   added: (roomunlocked room1)
   goals met: 8 of 9
27. (showroom room1 inhabitant1 am0915)
   added: (timeslotoccupied am0915) (roomoccupied room1) (hasroom inhabitant1)
   goals met: 9 of 9
